In [5]:
import pandas as pd
d=pd.DataFrame({
   "names":["ram","shyam","geetha"],
    "id":[5,6,7],
    "marks":[66,77,88]
})

In [6]:
d

    names  id  marks
0     ram   5     66
1   shyam   6     77
2  geetha   7     88

In [7]:
d.index=[7,8,9]
d

    names  id  marks
7     ram   5     66
8   shyam   6     77
9  geetha   7     88

In [8]:
d.columns

Index(['names', 'id', 'marks'], dtype='object')

In [9]:
d.index

Int64Index([7, 8, 9], dtype='int64')

In [11]:
d.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 7 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   id      3 non-null      int64
 2   marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 96.0+ bytes

In [12]:
d.describe()

        id  marks
count  3.0    3.0
mean   6.0   77.0
std    1.0   11.0
min    5.0   66.0
25%    5.5   71.5
50%    6.0   77.0
75%    6.5   82.5
max    7.0   88.0

In [13]:
d.size

9

In [14]:
d.shape

(3, 3)

In [16]:
d.dtypes

names    object
id        int64
marks     int64
dtype: object

In [23]:
d.dtypes.value_counts()

int64     2
object    1
dtype: int64

## indexing , selecting, slicing

In [28]:
d.loc[7]

names    ram
id         5
marks     66
Name: 7, dtype: object

In [29]:
d.loc[7:9]

    names  id  marks
7     ram   5     66
8   shyam   6     77
9  geetha   7     88

In [30]:
d.iloc[0]

names    ram
id         5
marks     66
Name: 7, dtype: object

In [31]:
d.drop(columns=["marks"])

    names  id
7     ram   5
8   shyam   6
9  geetha   7

In [32]:
d

    names  id  marks
7     ram   5     66
8   shyam   6     77
9  geetha   7     88

In [35]:
d.drop([8])

    names  id  marks
7     ram   5     66
9  geetha   7     88

In [36]:
d

    names  id  marks
7     ram   5     66
8   shyam   6     77
9  geetha   7     88

In [41]:
t=pd.Series([23,45,67],name="age")

In [42]:
t

0    23
1    45
2    67
Name: age, dtype: int64

In [49]:
d["age"]=t

In [45]:
d

    names  id  marks  age
7     ram   5     66  NaN
8   shyam   6     77  NaN
9  geetha   7     88  NaN

In [51]:
d["age"]=56

In [52]:
d

    names  id  marks  age
7     ram   5     66   56
8   shyam   6     77   56
9  geetha   7     88   56

In [54]:
d.rename(columns={"age":"vayasu"})

    names  id  marks  vayasu
7     ram   5     66      56
8   shyam   6     77      56
9  geetha   7     88      56

In [55]:
d.shape

(3, 4)

In [56]:
d.size

12

In [57]:
d.loc[7]

names    ram
id         5
marks     66
age       56
Name: 7, dtype: object

In [58]:
d.iloc[0]

names    ram
id         5
marks     66
age       56
Name: 7, dtype: object